SigninLogs
| where TimeGenerated > ago(365d)
| where OperationName =~ "Sign-in activity"
| where ResultType in ("50126", "50053", "50055", "50056")
| extend OS = DeviceDetail.operatingSystem, Browser = DeviceDetail.browser 
| extend LocationString= strcat(tostring(LocationDetails["countryOrRegion"]), "/", tostring(LocationDetails["state"]), "/", tostring(LocationDetails["city"]))
| summarize FailedLogins = count() by bin(TimeGenerated, 1d)
| render areachart