let ReportPeriod = 12h;
let ClientTimeZone = "Pacific/Auckland"; //New Zealand Time Zone
let OfficeOpenHour = 7; // 7AM
let OfficeCloseHour = 18; // 6 PM
SigninLogs
| where TimeGenerated > ago(ReportPeriod)
| extend NZTime = datetime_utc_to_local(TimeGenerated, ClientTimeZone)
| extend LoginHour = hourofday(NZTime)
| where LoginHour <= OfficeOpenHour or LoginHour >= OfficeCloseHour